#include<stdio.h>

    const uint8_t ff_ue_golomb_vlc_code[512]=
  { 32,32,32,32,32,32,32,32,31,32,32,32,32,32,32,32,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,
     7, 7, 7, 7, 8, 8, 8, 8, 9, 9, 9, 9,10,10,10,10,11,11,11,11,12,12,12,12,13,13,13,13,14,14,14,14,
     3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
     5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
     1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
     1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
     2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
     2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
    };
unsigned int glb_decode(unsigned int buf)
{
	printf("buf 0x%8X\n",buf);
	if(buf >= (1<<27)){                    //该编码为9bit以内
		buf >>= 32 - 9;                    //将buf右移23bit得到比特串
		return ff_ue_golomb_vlc_code[buf];
	}
	else printf("glb code > 9 bit*******************************\n");
	return 9999;
}

typedef union glb
{
	char buf[4];
	unsigned int k;
}glbbuf;
int main()
{
	FILE * fp;
	char a,b,c,d;
	char nalu_header;
	unsigned int glb;
	unsigned char nalu_type;
	glbbuf buf;
	fp = fopen("test.264","r");
	if(fp < 0)return -1;
	while(1)
		{
		do
			{
			if(fgetc(fp)==0x00)
				{
					if(fgetc(fp)==0x00)
						{
							if(fgetc(fp)==0x00)
								{
									if(fgetc(fp)==0x01)
										{
											nalu_header = fgetc(fp);
											nalu_type = nalu_header & 0x1f;
											printf("find nalu header , nalu type %d\n",nalu_type);
											if(nalu_type!=7&&nalu_type!=8)
												{
													buf.buf[3] = fgetc(fp);
													buf.buf[2] = fgetc(fp);
													buf.buf[1] = fgetc(fp);
													buf.buf[0] = fgetc(fp);
													printf("glb decode num_vlu %u\n",glb_decode(buf.k));
												}
										}
									else break;
								}
							else break;
						}
					else break;
				}
			else break;
			}
		while(0);
		if(fgetc(fp) == EOF)break;
		fseek(fp,-1,1);
		}
}
